{
  "id": "ea051e5a-38df-4209-8e2f-9dc526bcca63",
  "siteName": "Premium Harvest",
  "brandingPresets": [
    {
      "presetId": "9e792e4c-0adf-4df9-b286-bee3c5716a9a",
      "brandIdentity": {
        "designSummary": "This brand design embraces a modern minimalistic aesthetic with a focus on organic and natural tones. The layout is modular and grid-based, balancing generous white space with blocks of earthy and soft accent colors. Typography is clean and sans-serif, with large, bold headings paired with smaller, readable body text. A subtle serif italic font is used sparingly for emphasis, adding a touch of elegance. The color palette centers on a deep forest green as the primary color, complemented by a warm brown and a soft lavender accent, all set against a very light neutral background. Black is used for primary text to ensure clarity and contrast. UI elements like buttons and forms are understated with thin borders and minimal styling, reinforcing the clean and sophisticated feel. Photography is natural and organic but excluded from the core palette, serving to enhance the brand's authentic and quality-driven personality. Overall, the design communicates a refined, approachable, and organic brand identity suitable for premium, artisanal, or natural product brands.",
        "toneOfVoice": "Sophisticated, natural, approachable, and modern with a subtle elegance.",
        "tones": [
          "organic",
          "clean",
          "sophisticated",
          "minimalistic",
          "natural",
          "approachable",
          "elegant",
          "fresh",
          "authentic",
          "calm"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Organic"
          ],
          "supportingStyles": [
            "Modern",
            "Editorial",
            "Natural"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#0B3D0B",
            "primaryForeground": "#FFFFFF",
            "secondary": "#7A4B2B",
            "secondaryForeground": "#FFFFFF",
            "background": "#F7F7F5",
            "customColors": [
              {
                "name": "lavenderaccent",
                "value": "#C6B9FF"
              },
              {
                "name": "foreground",
                "value": "#0B3D0B"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color predominantly for footer backgrounds, key navigation elements, and important text highlights to ground the design with a natural, earthy tone. The 'primaryForeground' color should be used for text and icons on 'primary' backgrounds to ensure strong contrast and readability. The 'secondary' color serves as a warm accent for smaller UI elements, borders, and call-to-action highlights, paired with 'secondaryForeground' for text to maintain clarity. The 'lavenderAccent' color is ideal for background blocks or subtle highlights that add freshness and modernity without overwhelming the natural palette. The 'background' color provides a clean, neutral canvas for all content areas, ensuring that text and color blocks stand out crisply. Black text is used on light backgrounds for maximum legibility. Colors should be combined thoughtfully to maintain accessibility and a calm, organic atmosphere, avoiding overly saturated or bright combinations.",
          "paletteAccessibilityNotes": "The 'primary' color (#0B3D0B) paired with 'primaryForeground' (#FFFFFF) meets WCAG AA and AAA contrast standards for text and UI elements. The 'secondary' color (#7A4B2B) with 'secondaryForeground' (#FFFFFF) also meets WCAG AA contrast requirements. The 'lavenderAccent' (#C6B9FF) on 'background' (#F7F7F5) provides sufficient contrast for large text and UI backgrounds but should be used cautiously for small text to maintain accessibility. Black text on 'background' ensures excellent readability and meets all WCAG contrast guidelines."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "helvetica-w01-roman",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "open sans",
              "poppins-v2",
              "work-sans-v2"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to create a clear visual hierarchy. Pair with the paragraph font to maintain readability and balance. Headings should have ample spacing above and below to separate content blocks and enhance scanability. Use 'primary' or black text colors on light backgrounds for maximum contrast. Italic serif can be used sparingly for emphasis or subheadings to add elegance without disrupting the modern feel.",
            "headingsAccessibilityNotes": "Headings in 'primary' or black on 'background' meet WCAG AA and AAA contrast standards. Ensure font sizes are large enough to maintain readability, especially for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "rubik-v2",
              "work-sans-v2",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and smaller informational content. Maintain consistent line height and letter spacing for readability. Combine with the heading font to create a balanced typographic system. Text should primarily be black or 'primary' color on 'background' for clarity. Avoid using accent colors for body text to maintain legibility.",
            "paragraphsAccessibilityNotes": "Body text in black or 'primary' on 'background' meets WCAG AA contrast requirements for normal and large text. Maintain sufficient font size and spacing for accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a weighted quadrant layout where large, bold headings occupy the top-left quadrant, drawing immediate attention. Supporting text and call-to-action elements are placed in the bottom-right quadrant, balancing the composition. This asymmetrical but balanced placement creates visual interest and guides the user's eye naturally through the content. The typography is large and clear, with ample white space around to emphasize the message and maintain a clean, modern look."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.07em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Moderate Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid background colors from the palette, primarily the 'background' color for main content areas and 'primary' or 'secondary' colors for footer and accent sections. Padding is consistent to maintain spaciousness. Borders are minimal or absent, relying on color blocks to define sections.",
          "images": "Images are integrated into the grid with clean edges and no decorative borders. They are often paired with color blocks to create layered compositions. Image content is natural and organic but does not influence the core color palette.",
          "buttons": "Buttons are minimal with thin borders in 'secondary' color and transparent backgrounds by default. On hover or active states, they fill with 'secondary' color and use 'secondaryForeground' for text. The font is consistent with body text, and buttons have rounded corners for a soft, approachable feel."
        },
        "graphicElements": {
          "icons": "Icons are minimal, line-based, and use the 'primary' or black color to maintain clarity and simplicity. They complement the text without overwhelming the design.",
          "illustrations": "No prominent illustrations are used; the design relies on photography and color blocks for visual interest.",
          "stickers": "No stickers or badges are present, maintaining the clean and minimal aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1768773318349-Frame%202147238823.png"
      ]
    },
    {
      "presetId": "a7df74f4-2fb9-4de7-983e-74c8d3976069",
      "brandIdentity": {
        "designSummary": "The design features a minimalistic and spacious layout with a soft off-white background that creates a calm and neutral canvas. The primary color is a deep forest green used consistently for headings, text, icons, and buttons, conveying reliability and eco-consciousness. A lighter pastel green serves as a secondary color for backgrounds and highlights, adding freshness and subtle vibrancy. Typography combines a modern sans-serif font for headings with a monospaced or typewriter-style font for body text, emphasizing clarity and technical precision. The layout is balanced and column-based with generous white space, rounded corners on images and buttons, and a clean navigation system with pill-shaped buttons. Graphic elements are minimal and line-based, supporting the clean and professional aesthetic. Overall, the design communicates a harmonious blend of technology and sustainability, suitable for a wide range of industries focused on innovation and environmental responsibility.",
        "toneOfVoice": "Professional, trustworthy, and forward-thinking with a focus on sustainability and innovation. The tone is calm, precise, and approachable, reflecting a brand that is both technologically advanced and environmentally conscious.",
        "tones": [
          "calm",
          "trustworthy",
          "professional",
          "clean",
          "modern",
          "eco-friendly",
          "precise",
          "approachable",
          "minimal",
          "fresh"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modern"
          ],
          "supportingStyles": [
            "Eco-friendly",
            "Tech-focused",
            "Clean Typography"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#0B3D2E",
            "primaryForeground": "#FFFFFF",
            "secondary": "#C7E6C1",
            "secondaryForeground": "#0B3D2E",
            "background": "#F5F5F0",
            "customColors": [
              {
                "name": "foreground",
                "value": "#0B3D2E"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color for all main text elements, headings, icons, and primary buttons to establish brand recognition and ensure readability. The 'secondary' color is ideal for backgrounds of interactive elements such as highlighted job listings and call-to-action buttons, providing a fresh and inviting contrast to the 'primary' color. The 'background' color should be used as the base canvas for pages to maintain a soft, neutral environment that reduces eye strain and enhances content focus. Text on 'primary' backgrounds should use 'primaryForeground' to ensure high contrast and accessibility, while text on 'secondary' backgrounds should use 'secondaryForeground' for clarity. Avoid mixing colors outside this palette to maintain brand consistency and a cohesive visual identity.",
          "paletteAccessibilityNotes": "The 'primary' color (#0B3D2E) on the 'background' (#F5F5F0) provides excellent contrast exceeding WCAG AA standards for both normal and large text. Text in 'primaryForeground' (#FFFFFF) on 'primary' backgrounds also meets WCAG AA contrast requirements. The 'secondary' color (#C7E6C1) with 'secondaryForeground' (#0B3D2E) ensures sufficient contrast for readability on interactive elements. Overall, the palette supports accessible design for users with visual impairments and maintains legibility across devices."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "work-sans-v2",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "raleway",
              "poppins-v2",
              "rubik-v2"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to create a clear visual hierarchy. Italic styles can be applied selectively to emphasize key words or concepts, adding subtle dynamism without compromising readability. Pair headings with the monospaced paragraph font to balance modernity with technical precision. Maintain consistent spacing and avoid overcrowding to preserve the minimalistic aesthetic. Ensure headings use the 'primary' color for strong brand presence and accessibility.",
            "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' meet WCAG AA contrast standards, ensuring readability for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "azeret-mono",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "open sans",
              "roboto",
              "nunito sans"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, captions, and smaller UI text to maintain clarity and a technical feel. The monospaced style supports the brand's technology focus and contrasts well with the sans-serif headings. Text should primarily use the 'primary' color on the 'background' for optimal readability. Maintain adequate line height and spacing to enhance legibility, especially for longer text blocks.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'primary' color on 'background' meets WCAG AA contrast requirements, supporting accessible reading experiences."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section places the headline and key messaging in the top third of the viewport, aligned left to create a natural reading flow. This placement is visually balanced by a large image on the right with rounded corners, creating a harmonious split layout. The typography uses large, bold headings with italic emphasis on key words to draw attention, supported by smaller, monospaced body text below. Generous white space surrounds the text, enhancing focus and readability while maintaining a clean, modern aesthetic."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "-0.01em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.03em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.05em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.08em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use soft rounded corners and subtle background colors like 'secondary' for emphasis. They maintain consistent padding and margins to create a clean, organized structure. Borders are minimal or absent, relying on color and spacing for separation.",
          "images": "Images have rounded corners to soften the visual impact and integrate smoothly with the overall minimalistic design. They are balanced with text content and sized to maintain harmony within the grid layout.",
          "buttons": "Primary buttons use the 'primary' color with white text ('primaryForeground'), featuring rounded edges and a solid fill for clear call-to-action emphasis. Secondary buttons or less prominent actions use the 'secondary' background with 'secondaryForeground' text, often outlined or with subtle shadows to maintain hierarchy."
        },
        "graphicElements": {
          "icons": "Icons are minimal, line-based, and use the 'primary' color to maintain consistency and clarity. They are simple and functional, supporting navigation and interaction without distraction.",
          "illustrations": "No prominent illustrations are used; the design relies on realistic photography with natural colors, which are excluded from the core palette.",
          "stickers": "Stickers or badges, such as the 'Top 20' label, use the 'secondary' background with 'primary' text and rounded corners, maintaining the brand's clean and approachable style."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752411218271-Frame%201707483546.jpg"
      ]
    },
    {
      "presetId": "7d990c8f-c157-4460-a7a5-dc105dec9c53",
      "brandIdentity": {
        "designSummary": "This brand design embodies a refined, minimalistic, and elegant aesthetic with a warm, neutral color palette dominated by a beige/taupe background and deep black text and UI elements. The layout is spacious and balanced, employing a strict grid with generous negative space to create a calm and sophisticated atmosphere. Typography features large, high-contrast serif headings paired with delicate serif body text, reinforcing a classic and timeless feel. The interface uses minimalistic buttons with thin borders and monochrome icons, emphasizing clarity and understated luxury. The overall visual personality is professional, warm, and inviting, suitable for premium service brands that value tradition and modernity.",
        "toneOfVoice": "Sophisticated, calm, professional, refined, and trustworthy with a warm and inviting personality.",
        "tones": [
          "calm",
          "sophisticated",
          "minimal",
          "warm",
          "professional",
          "refined",
          "luxurious",
          "inviting",
          "classic",
          "elegant"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Editorial"
          ],
          "supportingStyles": [
            "Classic Elegance",
            "Modern Luxury"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#1A1A1A",
            "secondaryForeground": "#FFFFFF",
            "background": "#B7AEA3",
            "customColors": [
              {
                "name": "buttonbackground",
                "value": "#D9D2C9"
              },
              {
                "name": "buttonborder",
                "value": "#000000"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary canvas for most pages to create a warm and neutral environment. The 'primary' color is reserved for main text and key UI elements, ensuring strong readability and contrast. The 'secondary' color is used for dark backgrounds, such as booking sections, with 'secondaryForeground' for text to maintain accessibility. Buttons should use 'buttonBackground' for subtle fill with 'buttonBorder' for outlines, maintaining the minimalistic and elegant style. Avoid bright or saturated colors to preserve the sophisticated tone. Combine 'primary' and 'background' for text and backgrounds respectively to ensure clarity, and use 'secondary' backgrounds for emphasis or section differentiation.",
          "paletteAccessibilityNotes": "The 'primary' color on 'background' provides excellent contrast exceeding WCAG AA standards for text readability. The 'secondary' background with 'secondaryForeground' text also meets WCAG AA contrast ratios, ensuring accessibility in darker sections. Button text on 'buttonBackground' with 'buttonBorder' outlines maintains sufficient contrast for interactive elements. Overall, the palette supports strong accessibility compliance across all UI components."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "cormorantgaramond",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "bitter",
              "cormorantgaramond",
              "playfair display"
            ],
            "headingsUsageGuide": "Use the heading font for all primary titles and section headers to convey elegance and tradition. Pair with serif paragraph fonts for a cohesive look. Maintain ample spacing above and below headings to preserve clarity and hierarchy. Use 'primary' color for headings on light backgrounds and 'secondaryForeground' on dark backgrounds to ensure readability.",
            "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' meet WCAG AA contrast standards. On dark backgrounds, use 'secondaryForeground' for sufficient contrast."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "futura-lt-w01-book",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "bitter"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text and descriptive content. Maintain comfortable line height and letter spacing for readability. Pair with heading fonts to create a harmonious typographic hierarchy. Use 'primary' color for text on light backgrounds and 'secondaryForeground' on dark backgrounds to ensure accessibility.",
            "paragraphsAccessibilityNotes": "Body text in 'primary' color on 'background' meets WCAG AA contrast requirements. On dark backgrounds, use 'secondaryForeground' for sufficient contrast."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The large heading is anchored in the top-left quadrant, spanning horizontally with ample negative space around it. Supporting text and call-to-action button are placed below the heading on the left side, balanced by images on the right. This creates a visually weighted layout that draws attention to the brand message while maintaining harmony and spaciousness."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.015em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.01em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use subtle backgrounds or none, relying on layout and spacing for structure. They maintain generous padding and margins to preserve the spacious and clean aesthetic. Background colors alternate between 'background' and 'secondary' to differentiate sections.",
          "images": "Images are high-quality, warm-toned, and natural, framed with generous spacing. They serve as visual anchors but their colors are not part of the brand palette. Images have no borders or shadows, maintaining a clean presentation.",
          "buttons": "Buttons are minimalistic with thin 'buttonBorder' outlines and 'buttonBackground' fill on hover or active states. Text uses 'primary' or 'secondaryForeground' depending on background. Buttons have generous padding and subtle rounded corners, consistent with the elegant style."
        },
        "graphicElements": {
          "icons": "Icons are simple, monochrome line style using 'primary' or 'secondaryForeground' colors. They are minimal and unobtrusive, supporting navigation and user interaction without distraction.",
          "illustrations": "No illustrations are present; the design relies on photography and typography for visual interest.",
          "stickers": "No stickers or badges are used, maintaining a clean and sophisticated look."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1759225951028-Screenshot%202025-09-30%20at%2012.52.25.png"
      ]
    },
    {
      "presetId": "cd5185fd-2b89-41fa-b04e-4b34c80fc9f5",
      "brandIdentity": {
        "designSummary": "This website design features a refined and minimal aesthetic with a vintage artisanal touch. The overall style is clean and spacious, using a very light cream background that creates a warm and inviting atmosphere. Typography plays a central role, combining a classic serif font for headings and product titles with a monospace, typewriter-style font for body text, evoking authenticity and craftsmanship. The layout is grid-based and balanced, with generous white space that highlights product imagery and content blocks. Color usage is subtle and restrained, focusing on natural, muted tones such as soft blues and muted olive greens in content sections, contrasted with dark gray text for readability. UI elements like buttons are minimal and outlined with rounded corners, maintaining the delicate and understated feel. The design avoids heavy graphic elements, instead emphasizing clean lines, subtle borders, and natural product photography. This visual language conveys a calm, trustworthy, and sophisticated brand identity suitable for natural health, wellness, or boutique lifestyle brands.",
        "toneOfVoice": "Calm, trustworthy, refined, authentic, and approachable with a subtle vintage artisanal character.",
        "tones": [
          "calm",
          "trustworthy",
          "refined",
          "authentic",
          "minimal",
          "warm",
          "sophisticated",
          "natural",
          "inviting",
          "balanced"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Vintage Artisanal"
          ],
          "supportingStyles": [
            "Natural",
            "Classic",
            "Clean"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#2B2B2B",
            "primaryForeground": "#FFF9E9",
            "secondary": "#B9B89A",
            "secondaryForeground": "#2B2B2B",
            "background": "#FFF9E9",
            "customColors": [
              {
                "name": "softblue",
                "value": "#D6D9FF"
              },
              {
                "name": "foreground",
                "value": "#2B2B2B"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary canvas for all pages, providing a warm and inviting base. The 'primary' color is best suited for main text, headings, and key UI elements to ensure strong readability and contrast. The 'secondary' color can be used for accent blocks, subtle backgrounds, or secondary content areas to add natural warmth and depth. The 'softBlue' custom color is ideal for highlighting informational sections or subtle emphasis areas, creating a gentle contrast with the 'background'. Buttons and interactive elements should primarily use the 'primary' color for text and borders, maintaining clarity and accessibility. Combining 'primary' text on 'background' or 'softBlue' backgrounds ensures good contrast, while 'secondary' backgrounds with 'primary' text provide a natural, earthy feel. Avoid using heavy or saturated colors to maintain the calm and refined atmosphere. Overall, colors should be used sparingly and harmoniously to support the minimal and authentic brand tone.",
          "paletteAccessibilityNotes": "The 'primary' color on the 'background' color meets WCAG AA standards for normal text, ensuring readability and accessibility. The 'primary' color on 'softBlue' and 'secondary' backgrounds also meets WCAG AA contrast ratios for text and UI elements. Buttons using 'primary' text and borders on 'background' maintain sufficient contrast for accessibility. The palette avoids low-contrast combinations, supporting clear legibility across all text and interactive components."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "baskervillemtw01-smbdit",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "didot-w01-italic"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles, product names, and section headers to establish a refined and classic tone. Pair with the monospace paragraph font to create a distinctive contrast between headings and body text. Maintain generous spacing around headings to enhance readability and visual hierarchy. Use the 'primary' color for headings to ensure strong contrast against the 'background'. Avoid overly large sizes that disrupt the minimal balance.",
            "headingsAccessibilityNotes": "Headings in the 'primary' color on the 'background' color meet WCAG AA contrast requirements, ensuring clear legibility for all users."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "azeret-mono",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "roboto-thin",
              "open sans",
              "courier new"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and detailed content to convey an artisanal and authentic feel. The monospace style contrasts with the serif headings, enhancing the vintage character. Text should be set in the 'primary' color on the 'background' or 'softBlue' backgrounds for readability. Maintain consistent line height and letter spacing to avoid visual clutter. Avoid using this font for large headings or buttons to preserve hierarchy.",
            "paragraphsAccessibilityNotes": "Paragraph text in the 'primary' color on the 'background' color meets WCAG AA standards for normal text, ensuring accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section typography is anchored in the top third of the viewport, creating an immediate focal point upon page load. The large serif heading is prominently placed with generous spacing above and below, establishing a refined and elegant introduction. Supporting text uses the monospace font beneath the heading with ample line height and letter spacing to maintain clarity and balance. This placement leverages white space effectively, allowing the typography to breathe and set the tone for the rest of the site."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.05em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.04em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "400"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.01em",
              "fontWeight": "600"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.05em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.06em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use soft background colors such as 'softBlue' and 'secondary' to differentiate content sections. They have subtle borders and consistent padding to maintain a clean and organized layout. The 'background' color is used for the main page canvas, ensuring content stands out clearly.",
          "images": "Product images are presented in a clean, uniform grid with no heavy framing or shadows, emphasizing natural lighting and product details. Images have generous spacing around them to avoid clutter and maintain focus.",
          "buttons": "Buttons are minimal and outlined with the 'primary' color as the border and text. They have rounded corners and a subtle hover effect implied by the design style. The 'background' color is used behind buttons to maintain contrast and clarity."
        },
        "graphicElements": {
          "icons": "Icons are minimal or absent, maintaining the clean and understated aesthetic. If used, they would likely be simple line icons in the 'primary' color to complement the typography and layout.",
          "illustrations": "No illustrations are present, reinforcing the focus on product photography and natural textures.",
          "stickers": "Badges such as 'SALE' and 'NEW' are small, rounded rectangles with a light background and 'primary' color text, maintaining subtle emphasis without overpowering the design."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752411805018-Screenshot%202025-07-13%20at%2016.01.59%201.jpg"
      ]
    }
  ],
  "brandBook": {
    "tones": [
      "organic",
      "clean",
      "sophisticated",
      "minimalistic",
      "natural",
      "approachable",
      "elegant",
      "fresh",
      "authentic",
      "calm"
    ],
    "designStyle": {
      "primaryStyle": [
        "Minimalism",
        "Organic"
      ],
      "supportingStyles": [
        "Modern",
        "Editorial",
        "Natural"
      ]
    },
    "toneOfVoice": "Sophisticated, natural, approachable, and modern with a subtle elegance.",
    "components": {
      "images": "Images are integrated into the grid with clean edges and no decorative borders. They are often paired with color blocks to create layered compositions. Image content is natural and organic but does not influence the core color palette.",
      "buttons": "Buttons are minimal with thin borders in 'secondary' color and transparent backgrounds by default. On hover or active states, they fill with 'secondary' color and use 'secondaryForeground' for text. The font is consistent with body text, and buttons have rounded corners for a soft, approachable feel.",
      "containers": "Containers use solid background colors from the palette, primarily the 'background' color for main content areas and 'primary' or 'secondary' colors for footer and accent sections. Padding is consistent to maintain spaciousness. Borders are minimal or absent, relying on color blocks to define sections."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "Primary Heading Font",
          "fontFamily": "helvetica-w01-roman",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use the heading font for all major titles and section headers to create a clear visual hierarchy. Pair with the paragraph font to maintain readability and balance. Headings should have ample spacing above and below to separate content blocks and enhance scanability. Use 'primary' or black text colors on light backgrounds for maximum contrast. Italic serif can be used sparingly for emphasis or subheadings to add elegance without disrupting the modern feel.",
        "headingsSimilarFonts": [
          "open sans",
          "poppins-v2",
          "work-sans-v2"
        ],
        "headingsAccessibilityNotes": "Headings in 'primary' or black on 'background' meet WCAG AA and AAA contrast standards. Ensure font sizes are large enough to maintain readability, especially for users with visual impairments."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.2",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "500"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.5",
          "fontWeight": "600"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.4",
          "fontWeight": "600"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "0.035em",
          "lineHeight": "1.3",
          "fontWeight": "700"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1.2",
          "fontWeight": "700"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1.1",
          "fontWeight": "800"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "0.05em",
          "lineHeight": "1.1",
          "fontWeight": "800"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "0.05em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "0.06em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "0.07em",
          "lineHeight": "1",
          "fontWeight": "900"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "Main Body Text Font",
          "fontFamily": "open sans",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and smaller informational content. Maintain consistent line height and letter spacing for readability. Combine with the heading font to create a balanced typographic system. Text should primarily be black or 'primary' color on 'background' for clarity. Avoid using accent colors for body text to maintain legibility.",
        "paragraphsSimilarFonts": [
          "rubik-v2",
          "work-sans-v2",
          "poppins-v2"
        ],
        "paragraphsAccessibilityNotes": "Body text in black or 'primary' on 'background' meets WCAG AA contrast requirements for normal and large text. Maintain sufficient font size and spacing for accessibility."
      },
      "welcomeSectionTypography": {
        "placement": "Weighted Quadrant",
        "implementation": "The welcome section uses a weighted quadrant layout where large, bold headings occupy the top-left quadrant, drawing immediate attention. Supporting text and call-to-action elements are placed in the bottom-right quadrant, balancing the composition. This asymmetrical but balanced placement creates visual interest and guides the user's eye naturally through the content. The typography is large and clear, with ample white space around to emphasize the message and maintain a clean, modern look."
      }
    },
    "originImagesUrls": [
      "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1768773318349-Frame%202147238823.png"
    ],
    "layout": {
      "grid": {
        "margins": "Generous page margins",
        "padding": "Consistent padding within containers",
        "spacing": {
          "gaps": "Consistent medium gaps",
          "rows": "Defined content rows",
          "columns": "12-column grid"
        },
        "compositionApproach": "Modular"
      },
      "layoutDna": {
        "contrastSpectrum": "Moderate Contrast",
        "densitySpectrum": "Balanced",
        "textVsImageEmphasis": "Balanced",
        "complexitySpectrum": "Simple & Clean",
        "gridAlignmentSpectrum": "Modular",
        "negativeSpaceUsage": "Generous"
      }
    },
    "graphicElements": {
      "icons": "Icons are minimal, line-based, and use the 'primary' or black color to maintain clarity and simplicity. They complement the text without overwhelming the design.",
      "stickers": "No stickers or badges are present, maintaining the clean and minimal aesthetic.",
      "illustrations": "No prominent illustrations are used; the design relies on photography and color blocks for visual interest."
    },
    "designSummary": "This brand design embraces a modern minimalistic aesthetic with a focus on organic and natural tones. The layout is modular and grid-based, balancing generous white space with blocks of earthy and soft accent colors. Typography is clean and sans-serif, with large, bold headings paired with smaller, readable body text. A subtle serif italic font is used sparingly for emphasis, adding a touch of elegance. The color palette centers on a deep forest green as the primary color, complemented by a warm brown and a soft lavender accent, all set against a very light neutral background. Black is used for primary text to ensure clarity and contrast. UI elements like buttons and forms are understated with thin borders and minimal styling, reinforcing the clean and sophisticated feel. Photography is natural and organic but excluded from the core palette, serving to enhance the brand's authentic and quality-driven personality. Overall, the design communicates a refined, approachable, and organic brand identity suitable for premium, artisanal, or natural product brands.",
    "palette": {
      "colors": {
        "background": "#F7F7F5",
        "secondary": "#7A4B2B",
        "customColors": [
          {
            "name": "lavenderaccent",
            "value": "#C6B9FF"
          },
          {
            "name": "foreground",
            "value": "#0B3D0B"
          },
          {
            "name": "destructive",
            "value": "#DF3131"
          },
          {
            "name": "destructiveforeground",
            "value": "#FFFFFF"
          }
        ],
        "secondaryForeground": "#FFFFFF",
        "primaryForeground": "#FFFFFF",
        "primary": "#0B3D0B"
      },
      "paletteUsageGuide": "Use the 'primary' color predominantly for footer backgrounds, key navigation elements, and important text highlights to ground the design with a natural, earthy tone. The 'primaryForeground' color should be used for text and icons on 'primary' backgrounds to ensure strong contrast and readability. The 'secondary' color serves as a warm accent for smaller UI elements, borders, and call-to-action highlights, paired with 'secondaryForeground' for text to maintain clarity. The 'lavenderAccent' color is ideal for background blocks or subtle highlights that add freshness and modernity without overwhelming the natural palette. The 'background' color provides a clean, neutral canvas for all content areas, ensuring that text and color blocks stand out crisply. Black text is used on light backgrounds for maximum legibility. Colors should be combined thoughtfully to maintain accessibility and a calm, organic atmosphere, avoiding overly saturated or bright combinations.",
      "paletteAccessibilityNotes": "The 'primary' color (#0B3D0B) paired with 'primaryForeground' (#FFFFFF) meets WCAG AA and AAA contrast standards for text and UI elements. The 'secondary' color (#7A4B2B) with 'secondaryForeground' (#FFFFFF) also meets WCAG AA contrast requirements. The 'lavenderAccent' (#C6B9FF) on 'background' (#F7F7F5) provides sufficient contrast for large text and UI backgrounds but should be used cautiously for small text to maintain accessibility. Black text on 'background' ensures excellent readability and meets all WCAG contrast guidelines."
    }
  },
  "initialPrompt": "Create an informational website for Premium Harvest, the parent company of the brand Natures Choice. The site should introduce the company and its activities to visitors in the industry who may not know much about us. It should be a basic information website, not an e-commerce site. Include a homepage, an about page, a shop page listing what we sell (no prices, focused on wholesale/bulk orders), and a contact form for lead generation. Designer: Isla.",
  "status": "GENERATING",
  "generatingOptions": {
    "siteNameStatus": "COMPLETED",
    "siteDomainStatus": "NOT_STARTED",
    "brandBookStatus": "COMPLETED",
    "planStatus": "COMPLETED"
  },
  "revision": "7",
  "createdDate": "2026-01-20T06:56:55.787Z",
  "updatedDate": "2026-01-20T06:57:22.673Z",
  "attachments": {
    "contentImagesUrls": [],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "9e792e4c-0adf-4df9-b286-bee3c5716a9a",
  "plan": "\n\n```json\n{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This plan creates an informational website for Premium Harvest that introduces the company and its wholesale product offerings to industry visitors, with lead generation capabilities.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **View Company Information**: Visitors can read about Premium Harvest's background, mission, and activities.\\n- **View Product Listing**: Visitors can browse the wholesale products offered under the Natures Choice brand without pricing information.\\n- **View Product Details**: Visitors can see detailed information about individual wholesale products.\\n- **Submit Contact Form**: Visitors can submit inquiries for wholesale orders and lead generation.\",\n      \"metadata\": [\n        { \"id\": \"view-company-information\", \"name\": \"View Company Information\" },\n        { \"id\": \"view-product-listing\", \"name\": \"View Product Listing\" },\n        { \"id\": \"view-product-details\", \"name\": \"View Product Details\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" }\n      ]\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Header (Reusable)**: Contains the company logo and navigation links to all main pages.\\n- **Homepage**: Introduces Premium Harvest and provides an overview of the company's mission and the Natures Choice brand.\\n- **About Page**: Displays detailed information about Premium Harvest's history, values, and industry activities.\\n- **Shop Page**: Lists wholesale products with detailed views, focusing on bulk order information without pricing.\\n- **Contact Page**: Provides a contact form for wholesale inquiries and lead generation.\\n- **Footer (Reusable)**: Contains company contact information and relevant links.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"view-company-information\", \"name\": \"View Company Information\" },\n        { \"id\": \"view-product-listing\", \"name\": \"View Product Listing\" },\n        { \"id\": \"view-product-details\", \"name\": \"View Product Details\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" }\n      ]\n    }\n  ],\n  \"version\": \"4.0.0\"\n}\n```",
  "designerData": {
    "designerId": "643efd59-4335-4582-a3a6-9a56a8750a37",
    "designerName": "Isla",
    "selectionMethod": "UNSELECTED"
  }
}